/*
 * Xilinx DMA Engine support
 *
 * Copyright (C) 2010 Xilinx, Inc. All rights reserved.
 *
 * Based on the Freescale DMA driver.
 *
 * Description:
 * This driver supports three Xilinx DMA engines:
 *  . Axi DMA engine, it does transfers between memory and device. It can be
 *    configured to have one channel or two channels. If configured as two
 *    channels, one is to transmit to a device and another is to receive from
 *    a device.
 *  . Axi VDMA engine, it does transfers between memory and video devices.
 *    It can be configured to have one channel or two channels. If configured
 *    as two channels, one is to transmit to the video device and another is
 *    to receive from the video device.
 *
 * This is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 */


#include <linux/init.h>
#include <linux/module.h>
#include <linux/slab.h>
#include <linux/interrupt.h>
#include <linux/dmapool.h>
#include <asm/io.h>
#include <linux/of.h>
#include <linux/of_platform.h>
#include <linux/platform_device.h>
#include <linux/of_address.h>
#include <linux/amba/xilinx_dma.h>

/* Hw specific definitions
 */
#define XILINX_DMA_MAX_CHANS_PER_DEVICE  0x2
#define XILINX_DMA_MAX_TRANS_LEN         0x7FFFFF

/* General register bits definitions
 */

#define XILINX_DMA_CR_RUNSTOP_MASK  0x00000001  /* Start/stop DMA engine */

#define XILINX_DMA_SR_HALTED_MASK   0x00000001  /* DMA channel halted */
#define XILINX_DMA_SR_IDLE_MASK     0x00000002  /* DMA channel idle */

#define XILINX_DMA_SR_ERR_INTERNAL_MASK 0x00000010 /* Datamover internal err */
#define XILINX_DMA_SR_ERR_SLAVE_MASK    0x00000020 /* Datamover slave err */
#define XILINX_DMA_SR_ERR_DECODE_MASK   0x00000040 /* Datamover decode err */
#define XILINX_DMA_SR_ERR_SG_INT_MASK   0x00000100 /* SG internal err */
#define XILINX_DMA_SR_ERR_SG_SLV_MASK   0x00000200 /* SG slave err */
#define XILINX_DMA_SR_ERR_SG_DEC_MASK   0x00000400 /* SG decode err */
#define XILINX_DMA_SR_ERR_ALL_MASK      0x00000770 /* All errors */

#define XILINX_DMA_XR_IRQ_IOC_MASK	0x00001000 /* Completion interrupt */
#define XILINX_DMA_XR_IRQ_DELAY_MASK	0x00002000 /* Delay interrupt */
#define XILINX_DMA_XR_IRQ_ERROR_MASK	0x00004000 /* Error interrupt */
#define XILINX_DMA_XR_IRQ_ALL_MASK	    0x00007000 /* All interrupts */

#define XILINX_DMA_XR_DELAY_MASK    0xFF000000 /* Delay timeout counter */
#define XILINX_DMA_XR_COALESCE_MASK 0x00FF0000 /* Coalesce counter */

#define XILINX_DMA_DELAY_SHIFT    24
#define XILINX_DMA_COALESCE_SHIFT 16

#define XILINX_DMA_DELAY_MAX     0xFF /**< Maximum delay counter value */
#define XILINX_DMA_COALESCE_MAX  0xFF /**< Maximum coalescing counter value */

#define XILINX_DMA_RX_CHANNEL_OFFSET      0x30

/* Axi VDMA special register bits
 */
#define XILINX_VDMA_CIRC_EN         0x00000002  /* Circular mode */
#define XILINX_VDMA_SYNC_EN         0x00000008  /* Sync enable mode */
#define XILINX_VDMA_FRMCNT_EN       0x00000010  /* Frm Cnt enable mode */
#define XILINX_VDMA_MSTR_MASK       0x00000F00  /* Master in control */

#define XILINX_VDMA_MSTR_SHIFT      8
#define XILINX_VDMA_WR_REF_SHIFT    8

#define XILINX_VDMA_FRMDLY_SHIFT  24

#define XILINX_VDMA_DIRECT_REG_OFFSET     0x50
#define XILINX_VDMA_CHAN_DIRECT_REG_SIZE  0x50

/* BD definitions for Axi DMA
 */
#define XILINX_DMA_BD_STS_COMPL_MASK 0x80000000
#define XILINX_DMA_BD_STS_ERR_MASK   0x70000000
#define XILINX_DMA_BD_STS_ALL_MASK   0xF0000000

/* Axi DMA BD special bits definitions
 */
#define XILINX_DMA_BD_SOP       0x08000000    /* Start of packet bit */
#define XILINX_DMA_BD_EOP       0x04000000    /* End of packet bit */

/* Feature encodings
 */
#define XILINX_DMA_FTR_DATA_WIDTH_MASK 0x000000FF /* Data width mask, 1024 */
#define XILINX_DMA_FTR_HAS_SG          0x00000100 /* Has SG */
#define XILINX_DMA_FTR_HAS_SG_SHIFT    8          /* Has SG shift */
#define XILINX_DMA_FTR_STSCNTRL_STRM   0x00010000 /* Optional feature for dma */

/* Delay loop counter to prevent hardware failure
 */
#define XILINX_DMA_RESET_LOOP            1000000
#define XILINX_DMA_HALT_LOOP             1000000

/* IO accessors
 */
#define DMA_OUT(addr, val)  (iowrite32(val, addr))
#define DMA_IN(addr)  (ioread32(addr))

/* Hardware descriptor
 *
 * shared by all Xilinx DMA engines
 */
struct xilinx_dma_desc_hw {
	u32 next_desc;	/* 0x00 */
	u32 pad1;       /* 0x04 */
	u32 buf_addr;   /* 0x08 */
	u32 pad2;       /* 0x0C */
	u32 addr_vsize; /* 0x10 */
	u32 hsize;      /* 0x14 */
	u32 control;    /* 0x18 */
	u32 status;     /* 0x1C */
	u32 app_0;      /* 0x20 */
	u32 app_1;      /* 0x24 */
	u32 app_2;      /* 0x28 */
	u32 app_3;      /* 0x2C */
	u32 app_4;      /* 0x30 */
} __attribute__((aligned(64)));

struct xilinx_dma_desc_sw {
	struct xilinx_dma_desc_hw *hw;
	dma_addr_t phys;
};

struct xilinx_dma_transfer {
	struct dma_async_tx_descriptor async_tx;
	struct list_head head;

	unsigned int current_desc;
	unsigned int num_descs;
	struct xilinx_dma_desc_sw descs[];
};

struct xdma_regs {
	u32 cr;     /* 0x00 Control Register */
	u32 sr;     /* 0x04 Status Register */
	u32 cdr;    /* 0x08 Current Descriptor Register */
	u32 pad1;
	u32 tdr;    /* 0x10 Tail Descriptor Register */
	u32 pad2;
	u32 src;    /* 0x18 Source Address Register (cdma) */
	u32 pad3;
	u32 dst;    /* 0x20 Destination Address Register (cdma) */
	u32 pad4;
	u32 btt_ref;/* 0x28 Bytes To Transfer (cdma) or park_ref (vdma) */
	u32 version;         /* 0x2c version (vdma) */
};

struct vdma_addr_regs {
	u32 vsize;          /* 0x0 Vertical size */
	u32 hsize;          /* 0x4 Horizontal size */
	u32 frmdly_stride;  /* 0x8 Frame delay and stride */
	u32 buf_addr[16];   /* 0xC - 0x48 Src addresses */
};

/* Per DMA specific operations should be embedded in the channel structure
 */
struct xilinx_dma_chan {
	struct xdma_regs __iomem *regs;   /* Control status registers */
	struct vdma_addr_regs *addr_regs; /* Direct address registers */
	dma_cookie_t completed_cookie;	  /* The maximum cookie completed */
	dma_cookie_t cookie;	          /* The current cookie */
	spinlock_t lock;                  /* Descriptor operation lock */
	bool   sg_waiting;                /* Scatter gather transfer waiting */
	struct list_head active_list;	  /* Active descriptors */
	struct list_head pending_list;	  /* Descriptors waiting */
	struct dma_chan common;           /* DMA common channel */
	struct dma_pool *desc_pool;       /* Descriptors pool */
	struct device *dev;               /* The dma device */
	int    irq;                       /* Channel IRQ */
	int    id;                        /* Channel ID */
